app/controllers/book_data_downloads_controller.rb

SELECT `inst_books`.* FROM `inst_books` WHERE `inst_books`.`id` = 1 LIMIT 1
SELECT `odsa_exercise_attempts`.* FROM `odsa_exercise_attempts` WHERE `odsa_exercise_attempts`.`inst_book_id` = 3
SELECT `inst_book_section_exercises`.* FROM `inst_book_section_exercises` WHERE `inst_book_section_exercises`.`inst_book_id` = 3
SELECT `odsa_exercise_progresses`.* FROM `odsa_exercise_progresses` WHERE `odsa_exercise_progresses`.`inst_book_section_exercise_id` = 69
SELECT `odsa_exercise_progresses`.* FROM `odsa_exercise_progresses` WHERE `odsa_exercise_progresses`.`id` IN (3, 4, 5, 6, 7, 8, 9, 10)
SELECT `odsa_user_interactions`.* FROM `odsa_user_interactions` WHERE `odsa_user_interactions`.`inst_book_id` = 3
---
  def show
    @book = InstBook.find_by_id(params[:book_id])
    @ex_attempts = OdsaExerciseAttempt.where(inst_book_id: @book.id)
    @book_section_exercise = InstBookSectionExercise.where(inst_book_id: @book.id)
    @ex_progresses = Array.new
    @book_section_exercise.each do |exercise|
      @progress = OdsaExerciseProgress.where(inst_book_section_exercise_id: exercise.id)
      @ex_progresses.concat @progress
    end
    @ex_progresses = OdsaExerciseProgress.where(id: @ex_progresses.map(&:id))
    @md_progresses = OdsaModuleProgress.where(inst_book_id: @book.id)
    @interactions = OdsaUserInteraction.where(inst_book_id: @book.id)

SELECT `inst_books`.* FROM `inst_books` WHERE `inst_books`.`id` IS NULL LIMIT 1
SELECT `odsa_exercise_attempts`.* FROM `odsa_exercise_attempts` WHERE `odsa_exercise_attempts`.`inst_book_id` = 22 ORDER BY `odsa_exercise_attempts`.`id` ASC LIMIT 1
SELECT `inst_book_section_exercises`.* FROM `inst_book_section_exercises` WHERE `inst_book_section_exercises`.`inst_book_id` = 19
SELECT `odsa_exercise_progresses`.* FROM `odsa_exercise_progresses` WHERE `odsa_exercise_progresses`.`inst_book_section_exercise_id` = 1191
SELECT `odsa_exercise_progresses`.* FROM `odsa_exercise_progresses` WHERE `odsa_exercise_progresses`.`id` IN (27, 34, 38, 51, 28, 39, 52, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50) ORDER BY `odsa_exercise_progresses`.`id` ASC LIMIT 1
SELECT `odsa_user_interactions`.* FROM `odsa_user_interactions` WHERE `odsa_user_interactions`.`inst_book_id` = 22 ORDER BY `odsa_user_interactions`.`id` ASC LIMIT 1
---
  def index
    @book_id = session[:curr_book]
    @book = InstBook.find_by_id(@book_id)
    @ex_attempts = OdsaExerciseAttempt.where(inst_book_id: @book.id)
    @book_section_exercise = InstBookSectionExercise.where(inst_book_id: @book.id)
    @ex_progresses = Array.new
    @book_section_exercise.each do |exercise|
      @progress = OdsaExerciseProgress.where(inst_book_section_exercise_id: exercise.id)
      @ex_progresses.concat @progress
    end
    @ex_progresses = OdsaExerciseProgress.where(id: @ex_progresses.map(&:id))
    @md_progresses = OdsaModuleProgress.where(inst_book_id: @book.id)
    @interactions = OdsaUserInteraction.where(inst_book_id: @book.id)